{"pages":[{"title":"VisualCycle documentation","text":"For Authors For Developers For Marketing Daux.io is a documentation generator that uses a simple folder structure and Markdown files to create custom documentation on the fly. It helps you create great looking documentation in a developer friendly way. Features For Authors For Developers Full access to the internal API to create new pages programatically Work with pages metadata For Marketing 100% Mobile Responsive 4 Built-In Themes or roll your own Functional, Flat Design Style Optional code float layout Shareable\/Linkable SEO Friendly URLs Supports Google Analytics and Piwik Analytics","tags":"","url":"index.html"},{"title":"Deutsch","text":"GitHub Flavored Markdown A bit of the GitHub spice Math is hard, let's go shopping We all like making lists GitHub Flavored Markdown View the source of this content. Let's get the whole &quot;linebreak&quot; thing out of the way. The next paragraph contains two phrases separated by a single newline character: Roses are red Violets are blue The next paragraph has the same phrases, but now they are separated by two spaces and a newline character: Roses are red Violets are blue Oh, and one thing I cannot stand is the mangling of words with multiple underscores in them like perform_complicated_task or do_this_and_do_that_and_another_thing. A bit of the GitHub spice In addition to the changes in the previous section, certain references are auto-linked: SHA: be6a8cc1c1ecfe9489fb51e4869af15a13fc2cd2 User@SHA ref: mojombo@be6a8cc1c1ecfe9489fb51e4869af15a13fc2cd2 User\/Project@SHA: mojombo\/god@be6a8cc1c1ecfe9489fb51e4869af15a13fc2cd2 # Num: # 1 User\/# Num: mojombo# 1 User\/Project# Num: mojombo\/god# 1 These are dangerous goodies though, and we need to make sure email addresses don't get mangled: My email addy is tom@github.com. Math is hard, let's go shopping In first grade I learned that 5 &gt; 3 and 2 &lt; 7. Maybe some arrows. 1 -&gt; 2 -&gt; 3. 9 &lt;- 8 &lt;- 7. Triangles man! a^2 + b^2 = c^2 We all like making lists The above header should be an H2 tag. Now, for a list of fruits: Red Apples Purple Grapes Green Kiwifruits","tags":"","url":"de\/Deutsch.html"},{"title":"Fahrrad Ansicht","text":"","tags":"","url":"de\/Fahrrad_Ansicht.html"},{"title":"Körper Vermessung","text":"","tags":"","url":"de\/Körper_Vermessung.html"},{"title":"Fahrrad Vermessung","text":"","tags":"","url":"de\/Fahrrad_Vermessung.html"},{"title":"Überstandshöhe","text":"","tags":"","url":"de\/Überstandshöhe.html"},{"title":"Teste Mich","text":"","tags":"","url":"de\/Teste_Mich.html"},{"title":"Einstellungen","text":"","tags":"","url":"de\/Einstellungen.html"},{"title":"Hauptmenu","text":"","tags":"","url":"de\/Hauptmenu.html"},{"title":"English","text":"VisualCycle Overview Who benefits from using VisualCycle ? What VisualCycle can do for you: Features of VisualCycle ScreenShots Insert your own body measures Main Menu Submenus VisualCycle Overview Are you in the market for a custom frame and are afraid of choosing the wrong size ? Worry no more, just use VisualCycle to simulate your dream bike or your custom frame. VisualCycle is a stunning visual simulation of a custom cycle with you as the rider. All the relevant details are lovingly animated and of course, you can decide on all the frame dimensions and set your own body measures. VisualCycle can also help you to to decide if that rare cycle on auction is fitting you. Who benefits from using VisualCycle ? Anyone who wants to buy a cycle or cycle frame which can not be tried and tested. This would include: custom frames build according to a customers unique body measures. bikes sold only on the internet used bikes on auction What VisualCycle can do for you: VisualCycle currently does simulate a rigid Mountainbike (MTB) with a diamond frame together with the detailed rider.As a suspension fork in essence just adds a certain amount of sag (let`s say something like 15%), a suspension fork can be easily simulated by reducing the height of the fork stanchions. A full suspension bike (fully) can not be simulated with the current version of VisualCycle, but it is planned for a future version. Features of VisualCycle gorgeous visual simulation of a cycle plus you as a rider. insert your body measures into the simulation. find fitting saddle height and horizontal saddle position. change any frame parameter and watch the changes being instantly applied to the simulation. check on stand-over-height for any new frame dimension. touch and try the cycle, move limbs and cycle parts. extensive display of cycle measures, tube names and angles. ScreenShots Insert your own body measures You can enter your own body dimensions directly into the simulation. VisualCycle can use these body dimensions to check against certain parameters of the simulated bike frame, like stand-over-height, saddle height etc. Main Menu Above: Screenshot of the main menu of VisualCycle. The above screenshot shows the central point of access for VisualCycle. All functionality can be accessed in one of the submenus or with the Menu button at the top right. Submenus - Cycle - Body measures - Cycle measures - Standover height - Try_me - Settings","tags":"","url":"en\/English.html"},{"title":"Cycle","text":"The Cycle submenu The Cycle submenu The Cycle submenu is the main menu to watch and study the cycle animation. You will see your custom frame together with yourself fully animated. #","tags":"","url":"en\/Cycle.html"},{"title":"Body Measure","text":"","tags":"","url":"en\/Body_Measure.html"},{"title":"Cycle Measure","text":"Cycle measures submenu: Overview Frame tube: Other cycle measures: Frame angles: Documentation: Cycle measures submenu: Overview The Cycle measures submenu consists of 5 different parts, which are all explaining about the different measures of your cycle. You can activate the measures table with the Tables button at the top. In the measures tables, you can change the cycle frame dimensions and watch the instant changes right here in the cycle measures views !! Frame tube: Other cycle measures: Frame angles: View and change frame angles. Documentation: In this submenu some more arcane frame measures are explained in more detail. Currently the following measures are explained: Seat angle Steerer angle Trail **Above**: *Example screenshot of a documentation page.*","tags":"","url":"en\/Cycle_Measure.html"},{"title":"Standover Height","text":"Settings submenu Settings submenu This is a screenshot of the Standover height submenu : **Above**: *Screenshot of the main menu of the standover height menu.*","tags":"","url":"en\/Standover_Height.html"},{"title":"Try Me","text":"Try me !! submenu Try me !! submenu This is a screenshot of the Try me !! submenu : **Above**: *Screenshot of the main menu of the Try Me menu.*","tags":"","url":"en\/Try_Me.html"},{"title":"Settings","text":"Settings submenu Settings submenu This is a screenshot of the Settings submenu : 'Frame color' - change the color of the cycle frame. Check the frame color in the Cycle submenu. 'Fork color' - change the color of the fork. Check the fork color in the Cycle submenu. 'Change theme' - pick your favourite theme. 'Change language' - pick your favourite language. 'Disable following help pages' - VisualCycle provides on screen help. You can disable the help directly on screen. You can disable or re-enable the help page here with the check buttons. 'Reset settings' - reset the settings to factor settings.","tags":"","url":"en\/Settings.html"},{"title":"Main Menu","text":"Other cycle measures: Other cycle measures:","tags":"","url":"en\/Main_Menu.html"}]}